app/Models/Setting.php

select * from `settings` where `name` = 'security' limit 1
---
    static function getSetting(&$static, $name, $key = null)
    {
        // Check if tables exist before trying to access them
        // if (!Schema::hasTable('settings') || !Schema::hasTable('setting_translations')) {
        //     return [];
        // }

        if (!isset($static)) {
            $static = cache()->remember('settings.' . $name, 24 * 60 * 60, function () use ($name) {
                return self::where('name', $name)->first();